app/views/users/show.html.erb

SELECT "movies".* FROM "movies" INNER JOIN "receipts" ON "movies"."id" = "receipts"."movie_id" WHERE "receipts"."user_id" = ?  [["user_id", 14]]
SELECT 1 AS one FROM "movies" INNER JOIN "receipts" ON "movies"."id" = "receipts"."movie_id" WHERE "receipts"."user_id" = ? LIMIT ?  [["user_id", 33], ["LIMIT", 1]]
SELECT "receipts".* FROM "receipts" WHERE "receipts"."user_id" = ?  [["user_id", 33]]
---
      <%= "="*50 %>
    <% if !@user.movies.empty?%>
        <% @user.receipts.each do |receipt|%>

SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = ?  [["user_id", 33]]
---
      <tbody>
    <% @user.reviews.each do |review| %>