app/controllers/movies_controller.rb

  def create
    @movie = Movie.new(movie_params)

    if @movie.save
---
INSERT INTO "movies" ("name", "imdb", "premiered_on", "poster", "created_at", "updated_at", "link_imdb") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @movie = Movie.find(params[:id])

    @movie.update(movie_params)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "movies" SET "poster" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["poster", "https://images-na.ssl-images-amazon.com/images/I/61boFr6SYZL._SL1000_.jpg"], ["updated_at", "2020-12-14 16:16:32.066030"], ["id", 2]]