app/controllers/receipts_controller.rb

  def index
    @receipts = Receipt.all
---
SELECT "receipts".* FROM "receipts"

  def show
    @receipt = Receipt.find(params[:id])
---
SELECT "receipts".* FROM "receipts" WHERE "receipts"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]

  def create
    receipt_params[:movie_id].each do |movie_id|
      if movie_id != ""
        Receipt.create(movie_id: movie_id, user_id: receipt_params[:user_id], checkout_date: Time.now, due_date: Time.now + 7.days.to_i)
---
INSERT INTO "receipts" ("user_id", "movie_id", "checkout_date", "due_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 14], ["movie_id", 1], ["checkout_date", "2020-12-12"], ["due_date", "2020-12-19"], ["created_at", "2020-12-13 04:12:32.948164"], ["updated_at", "2020-12-13 04:12:32.948164"]]

  def destroy
    @receipt = Receipt.find(params[:id])
    user = @receipt.user
    @receipt.destroy
---
SELECT "receipts".* FROM "receipts" WHERE "receipts"."id" = ? LIMIT ?  [["id", 58], ["LIMIT", 1]]
DELETE FROM "receipts" WHERE "receipts"."id" = ?  [["id", 17]]