app/controllers/reviews_controller.rb

  def create
    @review = Review.create(review_params)
---
INSERT INTO "reviews" ("content", "rating", "user_id", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["content", "dsfafesefsefsf"], ["rating", 3.0], ["user_id", 22], ["movie_id", 1], ["created_at", "2020-12-14 17:10:26.776537"], ["updated_at", "2020-12-14 17:10:26.776537"]]

  def update
    @review = Review.find(params[:id])

    @review.update(review_params)

    if @review.save
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "reviews" SET "content" = ?, "rating" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["content", "Don't really understand at first but still curious about the end!!!"], ["rating", 9.2], ["updated_at", "2020-12-14 18:39:36.337286"], ["id", 2]]
UPDATE "reviews" SET "content" = ?, "rating" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["content", "Don't really understand at first but still curious about the end. Yolo"], ["rating", 4.2], ["updated_at", "2020-12-13 04:05:57.400373"], ["id", 2]]

  def destroy
    @review = Review.find(params[:id])
    user = @review.user
    @review.destroy
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 7]]