app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email_address", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Kai"], ["email_address", "kai99@gmail.com"], ["age", 21], ["created_at", "2020-12-12 21:17:37.252865"], ["updated_at", "2020-12-12 21:17:37.252865"]]
---
  def create
    @user = User.new(user_params)

    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "users" SET "email_address" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email_address", "werner96@gmail.com"], ["updated_at", "2020-12-12 18:05:30.368097"], ["id", 7]]
---
  def update
    @user = User.find(params[:id])

    @user.update(user_params)