app/views/reviews/_form.html.erb

  <label id="label">Movie</label><br>
  <%= f.collection_select :movie_id, Movie.all, :id, :name  %><br><br>
---
SELECT "movies".* FROM "movies"

  <label id="label">User</label><br>
  <%= f.collection_select :user_id, User.all, :id, :name %><br><br>
---
SELECT "users".* FROM "users"