app/views/receipts/new.html.erb

SELECT "users".* FROM "users"
---
  <label id="label">User</label><br>
  <%= f.collection_select :user_id, User.all, :id, :name %><br><br>

SELECT "movies".* FROM "movies"
---
  <label id="label">Movies</label><br><br>
  <%= f.collection_check_boxes :movie_id, Movie.all, :id, :name  %><br><br>